request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:dd="http://aaa.hr/test/v0/DataDetails">
    <soapenv:Header/>
    <soapenv:Body>
        <dd:DataDetails>
            <dd:Data>
                <dd:Operation>
                    <dd:ID>123</dd:ID>
                    <dd:arrivalDateTime>2022-01-01T00:00:00</dd:arrivalDateTime>
                    <dd:storingFlag>0</dd:storingFlag>
                    <dd:type>65754</dd:type>
                    <dd:additionalType>A</dd:additionalType>
                    <dd:acceptanceDate>2022-01-01</dd:acceptanceDate>
                </dd:Operation>
                <dd:Origin>
                    <dd:referenceNumber>CUA1A2A3</dd:referenceNumber>
                </dd:Origin>
                <dd:Destination>
                    <dd:referenceNumber>CUB1B2B3</dd:referenceNumber>
                </dd:Destination>
                <dd:DateOfStart>2022-01-01</dd:DateOfStart>
                <dd:AccountValue>400.00</dd:AccountValue>
                <dd:Exporter>
                    <dd:referenceNumber>CUC1C2C3</dd:referenceNumber>
                </dd:Exporter>
                <dd:VisitingLocations>
                    <dd:referenceNumber>CUA1A2A3</dd:referenceNumber>
                </dd:VisitingLocations>
                <dd:VisitingLocations>
                    <referenceNumber>CUA1A2A3</referenceNumber>
                </dd:VisitingLocations>
            </dd:Data>
        </dd:DataDetails>
    </soapenv:Body>
</soapenv:Envelope>
